{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Neo4j con Python"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "http://nicolewhite.github.io/neo4j-jupyter/hello-world.html"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "\n",
    "graph = Graph()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "graph.delete_all()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "from py2neo import Node\n",
    "\n",
    "nicole = Node(\"Person\", name=\"Nicole\", age=24)\n",
    "drew = Node(\"Person\", name=\"Drew\", age=20)\n",
    "\n",
    "mtdew = Node(\"Drink\", name=\"Mountain Dew\", calories=9000)\n",
    "cokezero = Node(\"Drink\", name=\"Coke Zero\", calories=0)\n",
    "\n",
    "coke = Node(\"Manufacturer\", name=\"Coca Cola\")\n",
    "pepsi = Node(\"Manufacturer\", name=\"Pepsi\")\n",
    "\n",
    "graph.create(nicole | drew | mtdew | cokezero | coke | pepsi)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figures/graph-561cf8dd-109f-4184-9bce-01a6adf63496.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7f056a713490>"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from scripts.vis import draw\n",
    "\n",
    "options = {\"Person\": \"name\", \"Drink\": \"name\", \"Manufacturer\": \"name\"}\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figures/graph-70aae06a-0ba0-4b18-b0f8-aae6cedcd96b.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7f056a49fcd0>"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Relationship\n",
    "\n",
    "graph.create(Relationship(nicole, \"LIKES\", cokezero))\n",
    "graph.create(Relationship(nicole, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(drew, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(coke, \"MAKES\", cokezero))\n",
    "graph.create(Relationship(pepsi, \"MAKES\", mtdew))\n",
    "\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(u'name': u'Drew', u'drink': u'Mountain Dew')\n",
      "(u'name': u'Nicole', u'drink': u'Mountain Dew')\n",
      "(u'name': u'Nicole', u'drink': u'Coke Zero')\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name AS name, drink.name AS drink\n",
    "\"\"\"\n",
    "\n",
    "data = graph.run(query)\n",
    "\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(u'name': u'Nicole', u'avg_calories': 4500.0)\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p:Person)-[:LIKES]->(drink:Drink)\n",
    "WHERE p.name = {name}\n",
    "RETURN p.name AS name, AVG(drink.calories) AS avg_calories\n",
    "\"\"\"\n",
    "\n",
    "data = graph.run(query, name=\"Nicole\")\n",
    "\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>person.name</th>\n",
       "        <th>drink.name</th>\n",
       "        <th>drink.calories</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Drew</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Coke Zero</td>\n",
       "        <td>0</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[u'Drew', u'Mountain Dew', 9000],\n",
       " [u'Nicole', u'Mountain Dew', 9000],\n",
       " [u'Nicole', u'Coke Zero', 0]]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name, drink.calories"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Drew</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Coke Zero</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name         drink\n",
       "0    Drew  Mountain Dew\n",
       "1  Nicole  Mountain Dew\n",
       "2  Nicole     Coke Zero"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = %cypher MATCH (person:Person)-[:LIKES]->(drink:Drink) \\\n",
    "                  RETURN person.name AS name, drink.name AS drink\n",
    "    \n",
    "df = results.get_dataframe()\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAeYAAAFBCAYAAACiigyZAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAIABJREFUeJzt3XlclXXe//E3CMgiRoJmSq7J5MoquJuW5cNGa5opSQk0\nNVNzaXFq5pezVd63S2k5ZlaioZncN9PYajouHEFUZBHHpRhN00zcUQFBlvP7oxnuEC2Fw7muc87r\n+d/xnOv49vEo3ny+1/e6Ljer1WoVAAAwBXejAwAAgP9DMQMAYCIUMwAAJkIxAwBgIhQzAAAmQjED\nAGAiFDMAACZCMQMAYCIUMwAAJkIxAwBgIhQzAAAmQjEDAGAiFDMAACZCMQMAYCIUMwAAJkIxAwBg\nIhQzAAAmQjEDAGAiFDMAACZCMQMAYCIUMwAAJkIxAwBgIhQzAAAmQjEDAGAiFDMAACZCMQMAYCIU\nMwAAJuJhdACYX0FBgZa/95727dqli4WF8vP3V/vOnTVmwgSFhIQYHQ8AnIqb1Wq1Gh0C5rRr1y69\n/vLL+nLDBv3GzU0DSkvVVFKxpDxPT63w8FBoaKhmzJqlYcOGGR0XAJwCxYxrWpGYqBeeflq/Ly1V\ngtWqgGt8pkxSiqQ/+vrqkaee0qvz5sndnbMjAFAfFDNq+WDlSv3uqae0vqREnW/g82ckDfP11T1P\nPaX/eu21ho4HoJ5KSkq0Zs0aZaen68LZs/L281Nwx456fMwYdezY0eh4Lo9iRg1ff/21+kdEaEtJ\nibrexHFnJPX29dX81av14IMPNlQ8APVw+PBhvTlvnlYmJamvm5vuLSpSgKTLkr7y9NSqRo0UGRmp\nqb//PaenDEQxo4ZpEycqIDFRf6mouOlj/0fSkshIbcnKsn0wAPWyZcsWjRwxQuNKS/VURYXaXuMz\npZL+V9Irfn4aFh+v+YsWqVGjRnZOCooZ1YqKitT2ttuUV1Ki4Docf0VSWx8fbcrKUpcuXWwdD0Ad\npaWl6ddDhyq5pESDbuDzhZIe9PVV15EjtXjZMrm5uTV0RPwIO3VQLSUlRf3d3etUypLkJWl8ebmW\nvfWWLWMBqIdz587pkV/+UqtusJQlKUDSpyUlSk9O1orExIaMh2ugmFHt0L/+pYiionp9R0RFhQ7t\n22ejRADqa/myZbqvvFz33eRxTSUtLCnRay+/LBZW7YtiRrWiwkL51fM7mkgqunTJFnEA1FNVVZWW\nvP66Jl++XKfjB0mqOHNGaWlptg2Gn0Qxo5p/s2aqb6VelNQ04FpXPQOwt9TUVPkXFyumjse7SZpc\nUqJ3FiywZSz8DIoZ1Tp36aKMJk3q9R0Znp66KzzcRokA1MfXX3+t6IoK1WfrVrTVqn8dOGCzTPh5\nFDOq/epXv9JuSf+q4/Elkt5v1EjjJ02yYSoAdVVUVCT/8vJ6fYe/pEv13HuCm0Mxo5q3t7eemDBB\nb3t51en4ZEkxPXuqQ4cOtg0GoE6aNGmiS56e9fqOS5L867mShptDMaOGSdOnK8nTUxk3edy3kmb5\n+uq5P/2pAVIBqIuQkBDt8vBQffZUZ7q5qVPnG7k5L2yFYkYNbdu21cqUFP3Kx0fbb/CYw5Lu+3cp\nDx48uCHjAbgJgwYN0kU/P2XW8XirpCW+vpowY4YtY+FnUMyoZejQoVqekqIRfn76rYeHDl/nc2ck\nzXN3Vx9fX0155RU9M3OmPWMC+Bnu7u6a9OyzesvHp07Hp0pqFBSkAQMG2DQXfhrFjGsaNmyYdu7Z\no8yoKHWRdLekOZKWSJov6XEfH3Xy9ta+X/9an23dqmnPPGNkXADX0X/gQP2trEwbb/K4i5Jm+Prq\nuVmzuCWnnXkYHQDm1aFDB/kEBKhUkkVSuqT+0dGKiI5WdEiIFo4apcDAQINTArieVatW6ZlnntGT\n06dr1NKl+p+SEt19A8cVSnrI11d9Hn1UY554ooFT4mo8xALXVVFRoVtvvVVFP7pUYv/+/erMRhDA\n1IqKivT0009rx44dSk5OVmhoqDZv3qzYBx+8oadLvernp/vj4vT64sU8XcoALGXjunJycmqUcosW\nLXTXXXcZmAjAz8nLy1NUVJTc3NyUnZ2t0NBQSdLgwYO1Iy9Pl8ePV4Svrx5s0kR/lbRS0juSnvP0\nVBtvb33Qp4/mr1mjN95+m1I2CEvZuC6LxVLj9cCBAznXBJiU1WrVW2+9pT/96U9asGCB4uLian2m\nQ4cOWrhkiV6dP18ffvihcjMyVHjmjHz8/NS6Y0dtS0hQp06dDEiPH6OYcV2pqak1Xg8cONCYIAB+\n0vnz5zVu3Dh9++23ysjI+Nly9fPz0/jx46Xx4+2UEDeDpWxcU2VlpdLT02v8GcUMmE9GRobCw8PV\npk2bGyplmB8TM65p9+7dunjxYvXroKAgdenSxcBEAH6sqqpKc+bM0cKFC/Xuu+9qxIgRRkeCjVDM\nuKarl7EHDBggd3cWWAAzKCgo0OOPP66ysjJlZ2crODjY6EiwIX7S4pqu3vh19913GxMEQA0bNmxQ\nRESE+vTpo82bN1PKToiJGbVUVlZq69atNf6M88uAscrLyzVr1iytWrVKH3zwgQYNGmR0JDQQihm1\n7NmzRxcuXKh+3axZM3Xr1s3ARIBrO3LkiB577DHdeuutys3NVfPmzY2OhAbEUjZquXoZm/PLgHH+\n9re/KTo6Wo888og+++wzStkFMDGjFq5fBox3+fJlPfvss9qwYYM+//xz9ezZ0+hIsBPGINRQVVVV\n6/wyG78A+zpw4IBiYmJ0/vx55eTkUMouhmJGDf/85z91/vz56tcBAQHq3r27gYkA12G1WpWYmKgB\nAwZo2rRp+vDDD3XLLbcYHQt2xlI2arj6/HL//v25kT1gBxcvXtSkSZOUl5en1NRUde3a1ehIMAgT\nM2rg+mXA/rKyshQREaEmTZooMzOTUnZxFDOqVVVVXfOJUgAahtVq1cKFCzVs2DDNnj1bS5cula+v\nr9GxYDCWslFt//79Onv2bPXrpk2bKiwszMBEgPM6c+aMxo4dq1OnTmnnzp1q37690ZFgEkzMqHb1\nZVKcXwYahsViUXh4uDp37qy0tDRKGTUwMaMay9hAw6qsrNTLL7+spUuXavny5Ro6dKjRkWBCFDMk\n/XCui41fQMP57rvvNHr0aHl4eCg7O1utWrUyOhJMiqVsSPrhhganT5+ufu3v76/w8HADEwHO47PP\nPlNUVJTuu+8+bdiwgVLGT2JihqTay9j9+vWThwf/eQD1UVZWphdffFEfffSRUlJS1K9fP6MjwQHw\nkxeSuD82YGsHDx5UbGys7rjjDuXm5qpZs2ZGR4KDYCkb1zy/TDEDdbd69Wr17t1bY8aM0UcffUQp\n46YwMUP5+fk6efJk9Ws/Pz9FRkYamAhwTMXFxZo2bZrS09P1j3/8g/sAoE6YmFFrGbtv377y9PQ0\nJgzgoPbs2aOoqChVVFQoOzubUkadUczgMimgHqxWq95++23dc889+t3vfqf3339fTZo0MToWHBhL\n2S7OarWy8Quoo8LCQo0fP16HDh3Stm3bFBISYnQkOAEmZhd38OBBnThxovq1j4+PoqKiDEwEOIYd\nO3YoPDxcrVq10vbt2yll2AwTs4u7ehm7b9++8vLyMigNYH5VVVWaN2+eXn/9db3zzjt68MEHjY4E\nJ0MxuziWsYEbd/LkScXHx6u4uFi7du1SmzZtjI4EJ8RStgvj/tjAjdu4caMiIiIUHR2t1NRUShkN\nxs1qtVqNDgFjHDp0SHfeeWf1a29vbxUWFqpx48YGpgLMpby8XH/84x/1/vvvKykpSffcc4/RkeDk\nWMp2YVdPy71796aUgR/59ttvNWrUKPn7+ys3N1ctWrQwOhJcAEvZLoxlbOD6PvroI/Xs2VMPPfSQ\nvvjiC0oZdsPE7MLY+AXUVlpaqueee07r1q3Tp59+qpiYGKMjwcUwMbuoI0eO6OjRo9WvGzduzA8g\nuLyvvvpKMTExOn36tHJycvh/AoagmF3U1dNyr1695O3tbUwYwGBWq1UrVqxQ//79NWXKFCUnJysg\nIMDoWHBRLGW7KB7zCPzg0qVLmjx5snJycrRlyxZ169bN6EhwcUzMLoqNX4CUk5OjyMhIeXt7a9eu\nXZQyTIHrmF3Q0aNH1bZt2+rXXl5eKiwslI+Pj4GpAPuxWq1atGiRXnnlFb355puKjY01OhJQjaVs\nF3T1tBwTE0Mpw2WcPXtWY8eO1YkTJ7R9+3Z17NjR6EhADSxlu6ArV64oODi4+jXnl+Eq0tLSFB4e\nrpCQEG3bto1ShikxMbugcePGKTAwUAsWLNATTzyhyMhIoyMBDaqyslKzZ8/W4sWLlZiYqGHDhhkd\nCbguitlFWSwWDR06VAkJCUZHARrU999/r7i4OFmtVmVnZ6t169ZGRwJ+EkvZLio1NZWd2HB669at\nU2RkpAYNGqSNGzdSynAI7Mp2QefPn1fbtm119uxZeXp6Gh0HsLkrV67o97//vZKTk/XBBx9owIAB\nRkcCbhhL2S4oLS1NvXr1opThlL755hvFxsaqZcuW2r17twIDA42OBNwUlrJdkMViYSc2nFJycrJi\nYmI0evRoffzxx5QyHBITswuyWCxauHCh0TEAmykpKdGMGTO0ZcsWffnll1xpAIfGxOxiLly4oK+/\n/lo9e/Y0OgpgE3v37lXPnj1VUlJSfYtNwJFRzC4mPT1d0dHRaty4sdFRgHqxWq169913NWjQIM2c\nOVMrV66Uv7+/0bGAemMp28VwmRScwYULF/Tkk0/qq6++Ulpamu666y6jIwE2w8TsYtj4BUeXmZmp\n8PBwBQUFaceOHZQynA7XMbuQixcvqlWrVjpz5oy8vb2NjgPclKqqKr3++uuaO3eu3n77bT388MNG\nRwIaBEvZLmTbtm3q2bMnpQyHc+rUKSUkJOjChQvKzMxUu3btjI4ENBiWsl0Iy9hwRJs3b1ZERITC\nw8NlsVgoZTg9itmFsPELjqSiokKzZs1SXFycli9frtmzZ3O3OrgElrJdRFFRkfbu3auYmBijowA/\n69ixYxo1apR8fHyUk5Ojli1bGh0JsBsmZheRkZGhiIgI+fj4GB0F+Ekff/yxoqKi9MADD+jLL7+k\nlOFymJhdBMvYMLuysjLNnDlTn3zyidauXavevXsbHQkwBBOzi2DjF8wsPz9fvXv31vHjx5Wbm0sp\nw6VRzC6guLhYeXl5/LCDKa1cuVJ9+/bVhAkTlJKSoltvvdXoSIChWMp2Adu3b1dYWJh8fX2NjgJU\nKyoq0tNPP62dO3dq06ZN6tGjh9GRAFNgYnYBLGPDbHbv3q3IyEi5u7srKyuLUgZ+hGJ2AWz8gllY\nrVYtXrxYQ4YM0R/+8AclJibKz8/P6FiAqXCvbCdXUlKiFi1a6OTJk/wAhKHOnTuncePG6ejRo1qz\nZo06depkdCTAlJiYndyOHTvUvXt3ShmG2rZtm8LDw9WuXTtlZGRQysBPYPOXk7NYLCxjwzCVlZWa\nM2eO3nzzTb377rsaPny40ZEA06OYnZzFYtGLL75odAy4oIKCAsXFxenKlSvKyspScHCw0ZEAh8BS\nthMrLS1VVlaW+vbta3QUuJj169crIiJC/fr10+bNmyll4CYwMTuxnTt3qmvXrvL39zc6ClxEeXm5\nXnrpJX3wwQdavXo1p1GAOmBidmKpqalcv4wGVVVVpXXr1kmSDh8+rP79+2vv3r3Kzc2llIE6opid\nGBu/0JBOnTqlBx54QMOGDdP06dMVExOjRx99VJ9++qmaN29udDzAYXEds5MqKytTUFCQjh8/rqZN\nmxodB05m8+bNiouL04kTJyRJbm5uSklJ0cMPP2xwMsDxMTE7qczMTN11112UMmyqoqJCs2bN0r33\n3ltdytIPd/RasmSJgckA58HmLyfF/bFha8eOHdOoUaOUnp5e672+fftq2bJlBqQCnA8Ts5Ni4xds\n6eOPP1ZoaGitUnZzc9NLL72k1NRUtWnTxqB0gHPhHLMTunLligIDA3Xs2DEFBAQYHQcOrKysTDNn\nztSiRYtqvdeyZUutWrVK99xzjwHJAOfFUrYTysrKUqdOnShl1Et+fr5iY2OVm5tb6737779fSUlJ\natGihQHJAOfGUrYT4jGPqK+VK1cqIiKiVil7eHho7ty5+uKLLyhloIFQzE6IjV+oq6KiIo0ZM0bx\n8fEqLi6u8V67du2Unp6umTNnyt2dHx1AQ+Ecs5MpLy9XYGCgjhw5ombNmhkdBw5k9+7dGjlypPLz\n82u998gjj+idd97h9AhgB/za62Sys7PVoUMHShk3zGq1avHixerVq1etUvb29tbSpUuVnJxMKQN2\nwuYvJ8MyNm7GuXPnNG7cOK1du7bWe126dFFycrK6detmQDLAdTExOxk2fuFGbdu2TeHh4dcs5fHj\nx2vXrl2UMmAAzjE7kYqKCgUGBurQoUMKCgoyOg5MqrKyUnPmzNEf/vAHVVZW1njP399f77zzjmJj\nYw1KB4ClbCeSk5OjNm3aUMq4roKCAsXFxWnTpk213ouKitKaNWvUsWNHA5IB+A+Wsp0Ij3nET1m/\nfr1CQ0OvWcrPPfectm3bRikDJkAxOxE2fuFaysvL9cILL2jo0KE6depUjfeCgoL0+eefa/78+fLy\n8jIoIYAf4xyzk6isrFRgYKDy8/O5IxOqHT58WI899ph27txZ6727775bq1atUuvWrQ1IBuB6mJid\nxO7du9W6dWtKGdVSUlIUHh5eq5Td3d31l7/8RRs3bqSUAROimJ0Ej3l0bvn5+XpmyhT1DAlRp5Yt\n1SU4WIMiI/X2kiUqKiqq8dnLly9r0qRJeuSRR3ThwoUa77Vu3VpbtmzRrFmz1KhRI3v+EwDcIJay\nncSIESMUFxenRx991OgosKGMjAz98dlnlZeXp3GVlRpRXq5ASVckHZGU6Oen1KoqjY6L08tz5+r7\n77/XyJEjtXfv3lrfNXz4cC1fvlyBgYF2/lcAuBkUsxOorKxUUFCQDhw4oJYtWxodBzaSvGaNpj7x\nhOZdvqxYSY2v87ljkl728tJ6f3+dLCpSWVlZjfc9PT01b948TZs2TW5ubg0dG0A9cR2zE9izZ49a\ntmxJKTuRL774QjOeeEKbLl9W95/57B2S3rlyRbPPntWrV7135513as2aNYqMjGygpABsjXPMToDL\npJzLxYsXFf/oo/r7DZTyj/1eUpwkn3+/Hj16tHJycihlwMFQzE6AjV/OZdXKlRokqVcdjp0tySrp\nzTff1MqVK+Xv72/bcAAaHMXs4KqqqpSWlkYxOwmr1aq35s3T5OLiOh0fKOnRxo1VWlLC+WTAQVHM\nDm7v3r0KDAxUq1atjI4CG9i9e7dKz5zR3fX4jollZUpassRWkQDYGcXs4FjGdi7Hjx/XLzw8VJ9Z\nN0TS96dP2yoSADujmB0cD65wLqWlpfKu5xWM3pIul5fbJhAAu6OYHVhVVRU7sp1MQECAztfz3HCh\npABfX9sEAmB3FLMD279/vwICAhQcHGx0FNhIjx49lFtWpsJ6fMd6ST25RApwWBSzA2Nadj6BgYG6\ns0MHJdbxeKukxU2aaPJvf2vLWADsiGJ2YGz8ci4HDx7UgAEDlLV/v16TVFmH79gh6WKTJhoyZIiN\n0wGwF4rZQVmtViZmJ2G1WvXWW28pNDRUGRkZkn44Tzz5Jr/ntKR4X1/98b//W+7u/K8NOCrule2g\nDhw4ID8/P7Vt29boKKiHY8eOady4cfrHP/5R489LJH3o7i5vd3ctqKj42d+gv5M0zNdXI6dM0eMJ\nCQ0VF4Ad8Gu1g+IyKcdmtVqVlJSk7t271yplSfrlL3+pzH37lBcWpp5Nmmi5fijrqx2W9KKnp8J9\nfBQ/a5ZenjOnoaMDaGBMzA7KYrFo6NChRsdAHZw6dUoTJ07U2rVra73n7++vhQsXauzYsXJzc9Om\nHTu0fv16vTV3rmbu3Kl7PTzUrKJCV9zddcTDQ7srKzVm7FhlTJumTp06GfCvAWBrPI/ZAVmtVt1+\n++3avn272rdvb3Qc3IS///3vmjhxok5f485cd999t5YvX6527dpd89jDhw8rIyND58+fl5eXl267\n7TYNGTJEvlyzDDgVJmYHlJ+fr8aNG1/3BzjMp7CwUFOnTtWqVatqveft7a05c+bo6aef/slNW+3b\nt+cXMcAFUMwO6D+XSfH0IMewYcMGPfHEEzp+/Hit96Kjo5WUlKRf/OIXBiQDYEZs/nJAbPxyDMXF\nxZo8ebLuv//+WqXs6empV155Rdu2baOUAdTAOWYHY7VaFRwcrK1bt6pjx45Gx8F1bNu2TQkJCTp0\n6FCt97p3766kpCSFhYUZkAyA2TExO5iDBw/Kzc1NHTp0MDoKrqG0tFQvvPCC+vfvX6uU3d3d9eKL\nL2rXrl2UMoDr4hyzg/nPMjbnl80nNzdXjz/+uPbt21frvTvvvFPvv/+++vTpY0AyAI6EidnBcH9s\n86moqNDLL7+s6Ojoa5bylClTtHv3bkoZwA3hHLMDsVqtatOmjTZv3szNJEziwIEDSkhI0K5du2q9\nFxwcrOXLl+vee+81IBkAR8XE7EAOHz6syspK3XnnnUZHcXlVVVVauHChIiIirlnKCQkJ+uc//0kp\nA7hpnGN2IFy/bA5HjhzRmDFjZLFYar3XokULLV26VA899JAByQA4AyZmB8L1y8ayWq1677331L17\n92uW8sMPP6y9e/dSygDqhWJ2IGz8Ms6JEyc0fPhwTZgwQUVFRTXeu+WWW7Ry5UqlpKSoefPmBiUE\n4CxYynYQR44cUVlZGXeJMsCaNWs0efJknT9/vtZ79913n5YtW6bg4GADkgFwRkzMDsJisXB+2c7O\nnj2rkSNH6rHHHqtVyr6+vlqyZIm+/PJLShmATTExOwiWse3vqaeeUkpKSq0/79u3r95//31uiQqg\nQTAxOwg2ftnfmDFjajyG0cvLS3PnzpXFYqGUATQYitkBHD16VEVFRercubPRUVxCRUWFZs+erbFj\nx+rxxx+XJEVERCgnJ0czZ85Uo0aNDE4IwJmxlO0AOL9sP/n5+UpISJCfn5+ysrJ0xx13aNCgQRo1\napQ8PT2NjgfABTAxO4D/FDMaTlVVlRYtWqQ+ffooLi5OGzZsUJs2beTm5qaEhARKGYDdMDE7gNTU\nVE2fPt3oGE7r6NGjGjt2rEpKSpSRkaGQkBCjIwFwYUzMJvfdd9+psLBQXbt2NTqK07FarVqxYoWi\noqI0ZMgQpaenU8oADMfEbHIWi0UDBgyosTsY9VdQUKCJEyfq22+/1caNG9WjRw+jIwGAJCZm0+P8\nsu2lpKQoLCxM3bt3V2ZmJqUMwFSYmE3OYrFoypQpRsdwCufOndPUqVOVlZWljz/+WDExMUZHAoBa\nmJhN7MSJEzp9+rS6d+9udBSHt27dOvXo0UNBQUHKzc2llAGYFhOziXF+uf4uXbqk559/XuvXr1dS\nUpIGDx5sdCQA+En8xDcx7o9dP2lpaQoNDVV5ebny8vIoZQAOgWI2MTZ+1U1paamef/55jRw5Um+8\n8YYSExN1yy23GB0LAG4IxWxSJ0+eVEFBgUJDQ42O4lCysrIUERGho0ePas+ePRo+fLjRkQDgpnCO\n2aQsFov69evHAxNuUHl5uV599VUtWbJECxcuVGxsLPcWB+CQKGaT4jGPN27//v2Kj49XixYtlJub\nq1atWhkdCQDqjKVsk2Lj18+rrKzU/PnzNXDgQE2cOFGff/45pQzA4TExm9Dp06f13XffKSwszOgo\npvXNN99ozJgxcnNz086dO9WhQwejIwGATTAxm9DWrVvVr18/eXjwe9PVrFarli5dqpiYGD300EPa\nsmULpQzAqfCT34RYxr6248ePa/z48Tp9+rQsFou6dOlidCQAsDkmZhNi41dNVqtVq1evVkREhHr3\n7q3t27dTygCclpvVarUaHQL/58yZM+rQoYPOnTvHUrZ+ON8+adIkHThwQElJSYqMjDQ6EgA0KCZm\nk0lLS1OfPn0oZUmffPKJQkND1b59e2VnZ1PKAFwCP/1NhmVs6cKFC5oxY4a2bt2q5ORk9e/f3+hI\nAGA3TMwm4+obvzZt2qQePXrI29tbeXl5lDIAl8M5ZhM5d+6c2rVrp7Nnz8rT09PoOHZVUlKiF154\nQWvXrtV7772n+++/3+hIAGAIJmYTSUtLU69evVyulHfs2KGwsDCdP39ee/bsoZQBuDTOMZuIqz3m\nsaysTH/+85+VmJioxYsX69e//rXRkQDAcEzMJuJKG7/y8vIUHR2t/fv3Ky8vj1IGgH/jHLNJFBYW\n6o477tDZs2fl5eVldJwGU1FRoblz52rBggWaP3++4uPjeTwjAPwIS9kmkZ6erpiYGKcu5fz8fCUk\nJMjPz0/Z2dlq06aN0ZEAwHRYyjYJZ75MqqqqSosWLVKfPn00evRobdiwgVIGgOtgYjYJi8Wi1157\nzegYNnf06FGNHTtWJSUlysjIUEhIiNGRAMDUmJhN4OLFizpw4ICio6ONjmIzVqtVK1asUFRUlIYM\nGaL09HRKGQBuABOzCaSnp6tnz57y9vY2OopNFBQUaOLEifr222+1ceNG9ejRw+hIAOAwmJhNwJku\nk0pJSVFYWJi6deumzMxMShkAbhITswmkpqZqzpw5Rseol3Pnzmnq1KnKysrS2rVr1atXL6MjAYBD\nYmI22KVLl7Rv3z7FxMQYHaXO1q1bpx49eigoKEi5ubmUMgDUAxOzwTIyMhQZGSkfHx+jo9y0S5cu\n6fnnn9f69euVlJSkwYMHGx0JABweE7PBHPX65bS0NIWGhqq8vFx5eXmUMgDYCMVsMEd7cEVpaame\nf/55jRw5Um+88YYSExN1yy23GB0LAJwGxWyg4uJi5eXlqXfv3kZHuSFZWVmKiIjQ0aNHtWfPHg0f\nPtzoSADgdDjHbKCMjAyFh4fL19fX6Cg/qby8XK+++qqWLFmihQsXKjY2lgdPAEADoZgN5AjXL+/f\nv1/x8fFq3ry5cnNz1apVK6MjAYBTYynbQGbe+FVZWan58+dr4MCBevLJJ/XFF19QygBgBzyP2SAl\nJSVq3rz07tpIAAAHZklEQVS5Tp06JT8/P6Pj1PDNN99ozJgxcnNz0/Lly9WhQwejIwGAy2BiNsj2\n7dsVGhpqqlK2Wq1aunSpYmJi9NBDD2nLli2UMgDYGeeYDWK2y6SOHz+u8ePH6/Tp07JYLOrSpYvR\nkQDAJTExG8QsG7+sVqtWr16t8PBw9erVS9u3b6eUAcBAnGM2wOXLl9W8eXOdOHFC/v7+huU4ffq0\nJk2apAMHDigpKUmRkZGGZQEA/ICJ2QA7d+5U165dDS3lTz75RKGhoWrfvr2ys7MpZQAwCc4xGyA1\nNdWwZewLFy5oxowZ2rp1q5KTk9W/f39DcgAAro2J2QBGbfzatGmTevToIW9vb+Xl5VHKAGBCnGO2\ns9LSUgUFBen7779X06ZN7fJ3lpSU6IUXXtDatWv13nvv6f7777fL3wsAuHlMzHaWmZmpzp07262U\nd+zYobCwMJ0/f1579uyhlAHA5DjHbGf2WsYuKyvTn//8ZyUmJuqvf/2rfvOb3zT43wkAqD8mZjuz\nx8avvLw8RUdHa9++fcrLy6OUAcCBcI7Zjq5cuaLAwEAdO3ZMAQEBNv/+iooKzZ07VwsWLND8+fMV\nHx/P4xkBwMGwlG1Hu3btUkhISIOUcn5+vhISEuTn56fs7Gy1adPG5n8HAKDhsZRtRw3xmMeqqiot\nWrRIffr00ejRo7VhwwZKGQAcGBOzHVksFk2ZMsVm33f06FGNHTtWJSUlysjIUEhIiM2+GwBgDCZm\nOykvL9f27dttclMPq9WqFStWKDIyUkOGDFF6ejqlDABOgonZTrKystSxY0c1a9asXt9TUFCgiRMn\n6siRI9V38gIAOA8mZjuxxWMeU1JSFBYWpm7dumnXrl2UMgA4ISZmO0lNTdXEiRPrdOy5c+c0depU\nZWVlae3aterVq5eN0wEAzIKJ2Q7Ky8uVkZFRp/PL69atU48ePRQUFKTc3FxKGQCcHBOzHeTk5Khd\nu3YKCgq64WOKior03HPPaf369UpKStLgwYMbMCEAwCyYmO3gZu+PnZaWptDQUJWXlysvL49SBgAX\nwsTcAEpKSnTixAkVFRXJ399fmzdv1oQJE372uNLSUr300ktavXq13n77bY0YMcIOaQEAZkIx21Bu\nbq7eeu01/e/f/qZmHh7yc3dXUWWlCoqLFdy8uTp37qwuXbpc89isrCzFx8era9eu2rNnz00tewMA\nnAcPsbCBgoICPTZ8uL7Zv18Ty8o0rrJSt/3o/e8kvevhoXc9PRURHa2Vf/+7br31Vkk/bAx79dVX\ntWTJEi1cuFCxsbE8eAIAXBjFXE9HjhzRoJgYjT1/Xv+vvFyNfuKz5ZJe8PLSl7ffri07d+rs2bOK\nj49X8+bNtWzZMrVq1cpesQEAJkUx10NhYaF6h4bqqe++0/Sqqhs+bpaHhz5o1kwXKys1e/ZsTZgw\ngSkZACCJXdn18tc33lDkyZM3VcqS9JeKCrU/c0bTp03Tk08+SSkDAKoxMddRRUWF2t92mz49d05h\ndTh+s6Tpbdtqz+HDFDMAoBoTcx199tlnuqO8vE6lLEmDJFWcPav09HRbxgIAODiKuY7WffSRYi9d\nqvPxbpJii4v1xaef2i4UAMDhUcx1dO7kyRqXRNVFC6tV5woKbJIHAOAcKOY6cnd3V31Pzlv//T0A\nAPwHrVBHgbffru/r+R0n3NwUePvtNskDAHAOFHMdjXj0Ua1q0qTOU3OVpA98ffXgww/bMhYAwMFR\nzHV033336YKfnzLrePx6SYHBwerZs6ctYwEAHBzFXEfu7u6a9OyzmuPjc9NTc6WkeX5+mvTb3zZE\nNACAA+MGI/VQXFysgVFR+uXBg/pTRcUNHWOVNN3LS3vDwvRlWpq8vLwaNiQAwKFQzPVUUFCge3r3\n1r3ff6//unJFvj/x2UuSpnp7a3+HDtqwbZsCAgLsFRMA4CBYyq6nli1balturo4PHqw23t561stL\n+Vd9Zq+kKY0bq623t6oeeEBbMjMpZQDANTEx29Dhw4e1dNEiLXv3XZVduaImHh66VF4ufz8/PTll\niiZMmqTWrVsbHRMAYGIUcwOoqqrSpUuXdOnSJTVt2lT+/v48qAIAcEMoZgAATIRzzAAAmAjFDACA\niVDMAACYCMUMAICJUMwAAJgIxQwAgIlQzAAAmAjFDACAiVDMAACYCMUMAICJUMwAAJgIxQwAgIlQ\nzAAAmAjFDACAiVDMAACYCMUMAICJUMwAAJgIxQwAgIlQzAAAmAjFDACAiVDMAACYCMUMAICJUMwA\nAJgIxQwAgIlQzAAAmAjFDACAiVDMAACYCMUMAICJUMwAAJgIxQwAgIlQzAAAmAjFDACAiVDMAACY\nCMUMAICJUMwAAJgIxQwAgIlQzAAAmAjFDACAiVDMAACYCMUMAICJUMwAAJgIxQwAgIlQzAAAmAjF\nDACAiVDMAACYCMUMAICJUMwAAJgIxQwAgIlQzAAAmAjFDACAiVDMAACYCMUMAICJUMwAAJgIxQwA\ngIlQzAAAmAjFDACAiVDMAACYCMUMAICJ/H9sJre/XLOrgQAAAABJRU5ErkJggg==\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x7f055844e950>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import networkx as nx\n",
    "%matplotlib inline\n",
    "\n",
    "results = %cypher MATCH p = (:Person)-[:LIKES]->(:Drink) RETURN p\n",
    "\n",
    "g = results.get_graph()\n",
    "\n",
    "nx.draw(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[(u'24', {u'age': 20, 'labels': [u'Person'], u'name': u'Drew'}),\n",
       " (u'25', {u'calories': 0, 'labels': [u'Drink'], u'name': u'Coke Zero'}),\n",
       " (u'27', {u'calories': 9000, 'labels': [u'Drink'], u'name': u'Mountain Dew'}),\n",
       " (u'28', {u'age': 24, 'labels': [u'Person'], u'name': u'Nicole'})]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.nodes(data=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{u'24': 1, u'25': 1, u'27': 2, u'28': 2}"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nx.degree(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph as PGraph\n",
    "from igraph import Graph as IGraph\n",
    "\n",
    "neo4j = PGraph()\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name AS source, drink.name AS target\n",
    "\"\"\"\n",
    "\n",
    "data = neo4j.run(query)\n",
    "tups = []\n",
    "\n",
    "for d in data:\n",
    "    tups.append((d[\"source\"], d[\"target\"]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<igraph.Graph at 0x7f0557e5d338>"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ig = IGraph.TupleList(tups)\n",
    "\n",
    "ig"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[u'Mountain Dew', u'Nicole']"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "best = ig.vs.select(_degree = ig.maxdegree())[\"name\"]\n",
    "best"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "collapsed": false,
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-71fdbd6e-aab4-4dc3-b0ac-435cf4021d9c\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {jgraph: ['nbextensions/jgraph.min', 'https://rawgit.com/patrickfuller/jgraph/master/js/build/jgraph.min']}});\n",
       "           require(['jgraph'], function () {\n",
       "               var $d = $('#graph-71fdbd6e-aab4-4dc3-b0ac-435cf4021d9c');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.jgraph = jQuery.extend({}, jgraph);\n",
       "               $d.jgraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true,\n",
       "                                     showSave: false});\n",
       "               $d.jgraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 1, \"target\": 2 },\n",
       "        { \"source\": 2, \"target\": 3 },\n",
       "        { \"source\": 3, \"target\": 4 },\n",
       "        { \"source\": 4, \"target\": 1 },\n",
       "        { \"source\": 4, \"target\": 5 },\n",
       "        { \"source\": 5, \"target\": 2 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"1\": { \"location\": [ -2.000, -2.000, -2.000 ] },\n",
       "        \"2\": { \"location\": [ -1.466, -1.293, -1.274 ] },\n",
       "        \"3\": { \"location\": [ 0.108, 0.328, -0.223 ] },\n",
       "        \"4\": { \"location\": [ 1.228, 0.987, 1.363 ] },\n",
       "        \"5\": { \"location\": [ 2.000, 2.000, 2.000 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.jgraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import jgraph\n",
    "\n",
    "jgraph.draw([(1, 2), (2, 3), (3, 4), (4, 1), (4, 5), (5, 2)])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-517b6bf5-be15-4d14-bacf-f2bf817ac40c\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {jgraph: ['nbextensions/jgraph.min', 'https://rawgit.com/patrickfuller/jgraph/master/js/build/jgraph.min']}});\n",
       "           require(['jgraph'], function () {\n",
       "               var $d = $('#graph-517b6bf5-be15-4d14-bacf-f2bf817ac40c');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.jgraph = jQuery.extend({}, jgraph);\n",
       "               $d.jgraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true,\n",
       "                                     showSave: false});\n",
       "               $d.jgraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 24, \"target\": 27 },\n",
       "        { \"source\": 26, \"target\": 27 },\n",
       "        { \"source\": 28, \"target\": 27 },\n",
       "        { \"source\": 28, \"target\": 25 },\n",
       "        { \"source\": 29, \"target\": 25 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"24\": { \"location\": [ -2.000, -2.000, -2.000 ] },\n",
       "        \"25\": { \"location\": [ -1.188, -1.614, -1.771 ] },\n",
       "        \"26\": { \"location\": [ -0.320, -0.833, -0.617 ] },\n",
       "        \"27\": { \"location\": [ 0.493, 0.907, 0.613 ] },\n",
       "        \"28\": { \"location\": [ 1.467, 1.427, 1.614 ] },\n",
       "        \"29\": { \"location\": [ 2.000, 2.000, 2.000 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.jgraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "data = graph.run(\"MATCH (n)-->(m) RETURN ID(n), ID(m)\")\n",
    "data = [tuple(x) for x in data]\n",
    "\n",
    "jgraph.draw(data)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
