{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Neo4j con Python"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "http://nicolewhite.github.io/neo4j-jupyter/hello-world.html"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "\n",
    "graph = Graph()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "graph.delete_all()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "from py2neo import Node\n",
    "\n",
    "nicole = Node(\"Person\", name=\"Nicole\", age=24)\n",
    "drew = Node(\"Person\", name=\"Drew\", age=20)\n",
    "\n",
    "mtdew = Node(\"Drink\", name=\"Mountain Dew\", calories=9000)\n",
    "cokezero = Node(\"Drink\", name=\"Coke Zero\", calories=0)\n",
    "\n",
    "coke = Node(\"Manufacturer\", name=\"Coca Cola\")\n",
    "pepsi = Node(\"Manufacturer\", name=\"Pepsi\")\n",
    "\n",
    "graph.create(nicole | drew | mtdew | cokezero | coke | pepsi)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-a48a6540-8186-4c53-9ae0-d110c81fd975.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7f91e8a93210>"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from scripts.vis import draw\n",
    "\n",
    "options = {\"Person\": \"name\", \"Drink\": \"name\", \"Manufacturer\": \"name\"}\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-6d35fb38-a8fa-4ed9-ae3f-9b5b0bbbe33e.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7f91e8a8fb10>"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Relationship\n",
    "\n",
    "graph.create(Relationship(nicole, \"LIKES\", cokezero))\n",
    "graph.create(Relationship(nicole, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(drew, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(coke, \"MAKES\", cokezero))\n",
    "graph.create(Relationship(pepsi, \"MAKES\", mtdew))\n",
    "\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(u'name': u'Nicole', u'drink': u'Mountain Dew')\n",
      "(u'name': u'Nicole', u'drink': u'Coke Zero')\n",
      "(u'name': u'Drew', u'drink': u'Mountain Dew')\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name AS name, drink.name AS drink\n",
    "\"\"\"\n",
    "\n",
    "data = graph.run(query)\n",
    "\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(u'name': u'Nicole', u'avg_calories': 4500.0)\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p:Person)-[:LIKES]->(drink:Drink)\n",
    "WHERE p.name = {name}\n",
    "RETURN p.name AS name, AVG(drink.calories) AS avg_calories\n",
    "\"\"\"\n",
    "\n",
    "data = graph.run(query, name=\"Nicole\")\n",
    "\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>person.name</th>\n",
       "        <th>drink.name</th>\n",
       "        <th>drink.calories</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Coke Zero</td>\n",
       "        <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Drew</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[u'Nicole', u'Mountain Dew', 9000],\n",
       " [u'Nicole', u'Coke Zero', 0],\n",
       " [u'Drew', u'Mountain Dew', 9000]]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name, drink.calories"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Coke Zero</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Drew</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name         drink\n",
       "0  Nicole  Mountain Dew\n",
       "1  Nicole     Coke Zero\n",
       "2    Drew  Mountain Dew"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = %cypher MATCH (person:Person)-[:LIKES]->(drink:Drink) \\\n",
    "                  RETURN person.name AS name, drink.name AS drink\n",
    "    \n",
    "df = results.get_dataframe()\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAd8AAAFBCAYAAAA2bKVrAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAHtFJREFUeJzt3Wl8lPXd7/HvJJOEbAIJhB1MggLBUsIqsjQLCQiY1HJK\nF+5b69JSlWqrCKftffe0d89pS0ALhbpbLLzwiKIlCYsmEIwadmJRyiYSwMiOZDOZTJKZ86A31yE1\nQEgm1zXL5/0sw1wz33n54OvvWv5/m9vtdgsAAJgmyOoAAAAEGsoXAACTUb4AAJiM8gUAwGSULwAA\nJqN8AQAwGeULAIDJKF8AAExG+QIAYDLKFwAAk1G+AACYjPIFAMBklC8AACajfAEAMBnlCwCAyShf\nAABMRvkCAGAyyhcAAJNRvgAAmIzyBQDAZJQvAAAmo3wBADAZ5QsAgMkoXwAATEb5AgBgMsoXAACT\nUb4AAJiM8gUAwGSULwAAJqN8AQAwGeULAIDJKF8AAExG+QIAYDLKFwAAk1G+AACYjPIFAMBklC8A\nACajfAEAMBnlCwCAyShfAABMRvkCAGAyyhcAAJNRvgAAmIzyxXW53W41NjZaHQMA/AblixadPn1a\n//WrXymxZ0+FhYQoLDRUkaGhGj9smFatWiWHw2F1RADwWTa32+22OgS8xxdffKG5992nTe+8o+/Y\nbJrjcChJUqikGklFkp6JitKHNpvmLVigJ3/xC9lsNmtDA4CPoXxhKC8vV8b48Zpy5ox+43Sq8zXe\ne0TSv0VEKGnGDL386qsKDg42KyYA+DzKF5KkyspKTUhO1uyTJ/U/m5padUytpOkREfr6PfdoybPP\ndmxAAPAjXPOFJOl3v/61Rp06pQWtLF5JipD0Vm2t1q1cqe3bt3dcOADwM0y+kMPhUP/u3bW9pkaJ\nbTj+KZtN+771La1cu9bj2QDAHzH5Qm+88YZGSm0qXkn6gdut/A0bdOHCBU/GAgC/RflCb7z8su6t\nqWnz8bGSMoODlZ+f77lQAODHKF/o3Nmz6t/Oz+hfX6/z5897JA8A+DvKF2psbJS9nZ9hd7nU0NDg\nkTwA4O8oX6hr165q79XaC2Fh6tq1q0fyAIC/o3yhtKwsvdWpU5uPd0rKl5SamuqxTADgz3jUCDp3\n7pwGDRigYw6H2jK7vibphVGjVLR7t6ejAYBfYvKF4uLiNG3qVL3YhjWaXZL+FBmphxcs8HwwAPBT\nTL6QJB06dEiTRo/WmpoatfbksVvS/NBQ7Rg6VEU7dyokJKQjIwKA32DyhSRp8ODBWpOXp1kREcpt\nxfubJP00NFRv9+mjdYWFFC8A3ADKF4bU1FT95+9/r+9JGiXpDUn/+vDQeUkLg4I0MDJSh8eM0ful\npYqNjTU9KwD4Mk47o5n09HQVFRVJkqIk2YOClBQdrQhJFZI+qa/Xt775TT38xBMaNWqUlVEBwGdR\nvjDs2bNHo0ePbvbaunXrFBsbq9raWnXu3Fm33norz/MCQDu1d2Ej+JGcnJxmf6ekpCg7O9uiNADg\nv5h8IUk6evSoBg0aJJfLZby2adMmTZ061cJUAOCfuOEKkqSnnnqqWfEOGzZMU6ZMsTARAPgvyhc6\ne/asVqxY0ey1+fPny9aGRTcAANdH+ULLli1TfX298Xf//v01a9YsCxMBgH+jfANcdXW1/vznPzd7\n7fHHH2fRDADoQJRvgHvppZdUUVFh/B0TE6MHH3zQwkQA4P8o3wDmdDr19NNPN3vtkUceUWRkpEWJ\nACAwUL4B7LXXXlN5ebnxd6dOnfSTn/zEwkQAEBgo3wDlcrm+sqjG/fffr+7du1uUCAACB4tsBKj1\n69frrrvuMv4OCgrSJ598ooSEBAtTAUBgYPINUP869X7729+meAHAJEy+AWj79u264447mr22d+9e\njRgxwqJEABBYmHwD0L9OvZMnT6Z4AcBETL4B5tChQ0pKStKV/9kLCws1efJkC1MBQGBh8g0wixcv\nbla8ycnJSk9PtzARAAQeyjeAnDp1SqtWrWr22oIFC9hAAQBMRvkGkKVLl8rpdBp/x8fHa+bMmRYm\nAoDARPkGiMrKSj333HPNXps3b57sdrtFiQAgcFG+AeL5559XVVWV8Xe3bt30gx/8wLpAABDAKN8A\nUF9fryVLljR77dFHH1VERIRFiQAgsPGoUQAoKCjQlClTjL8jIiJ08uRJxcbGWpgKAAIXk28AyMzM\n1BtvvKGIiAiFhITohz/8IcULABZi8g0Q3/3udzVmzBh95zvfkd1uV48ePayOBAABi/INAJ9++qnG\njh2rsrIyRUdHWx0HAAIep50DwNNPP605c+ZQvADgJZh8/dy5c+c0ePBgHTx4kFPNAOAlmHz93PLl\nyzVr1iyKFwC8CJOvH6upqVF8fLy2b9+ugQMHWh0HAPDfmHz92Msvv6yUlBSKFwC8DJOvn2poaNDA\ngQO1du1ajR492uo4AIArMPn6qTVr1igxMZHiBQAvxJY2fsjtdisnJ0eLFi2yOgoAoAVMvn7o7bff\nVlBQkDIzM62OAgBoAeXrhxYuXKj58+fLZrNZHQUA0ALK18/s3LlTx48f16xZs6yOAgC4CsrXz+Tk\n5OiJJ56Q3c7lfADwVjxq5EeOHDmiCRMmqKysTJGRkVbHAQBcBZOvH1m8eLEefvhhihcAvByTr584\nc+aMkpKSdOTIEXXr1s3qOACAa2Dy9RNLly7V7NmzKV4A8AFMvn6gqqpKCQkJ2r17t+Lj462OAwC4\nDiZfP/DCCy8oMzOT4gUAH8Hk6+OcTqcSEhKUn5+v5ORkq+MAAFqBydfHrV69WkOHDqV4AcCHMPn6\nMJfLpdtuu03Lli1Tenq61XEAAK3E5OvD1q9fr4iICKWlpVkdBQBwAyhfH5aTk8MGCgDggyhfH1VS\nUqLTp09r5syZVkcBANwgytdH5eTkaN68eQoODrY6CgDgBnHDlQ86cOCA0tLSVFZWpvDwcKvjAABu\nEJOvD1q0aJHmzp1L8QKAj2Ly9THl5eUaNmyYjh49qpiYGKvjAADagMnXxyxZskT33nsvxQsAPozJ\n14dUVFQoMTFRf//739WvXz+r4wAA2ojJ14c8++yzmjFjBsULAD6OyddHOBwOxcfHq7CwULfddpvV\ncQAA7cDk6yNWrlypkSNHUrwA4AeYfH1AU1OThgwZopdeekmTJk2yOg4AoJ2YfH3AunXrFBsbq4kT\nJ1odBQDgAZSvl3O73Vq4cCEbKACAH6F8vVxxcbEqKyuVnZ1tdRQAgIdQvl4uJydHTz75pIKC+E8F\nAP6CG6682EcffaSpU6eqrKxMYWFhVscBAHgI45QXW7RokR577DGKFwD8DJOvlzpx4oRGjBihY8eO\nqXPnzlbHAQB4EJOvl/rjH/+oBx54gOIFAD/E5OuFLl68qFtuuUX79+9X7969rY4DAPAwJl8v9Mwz\nz+juu++meAHATzH5epna2lrFx8eruLhYgwcPtjoOAKADMPl6mVdeeUXjxo2jeAHAjzH5epHGxkbd\neuutWr16tcaNG2d1HABAB2Hy9SJvvvmm+vTpQ/ECgJ+jfL3E5Q0UFixYYHUUAEAHo3y9xJYtW1Rf\nX69p06ZZHQUA0MEoXy9xedtANlAAAP/HDVdeoLS0VNnZ2fr0008VGhpqdRwAQAdjzPICOTk5+tnP\nfkbxAkCAYPK12LFjxzRmzBiVlZUpOjra6jgAABMw+Vrsqaee0pw5cyheAAggTL4WOn/+vAYNGqSD\nBw+qR48eVscBAJiEyddCy5Yt06xZsyheAAgwTL4WqampUXx8vLZt26ZbbrnF6jgAABMx+Vrk5Zdf\nVkpKCsULAAGIydcCDQ0NGjhwoNauXavRo0dbHQcAYDImXwusWbNGiYmJFC8ABCjK12Rut1s5OTma\nP3++1VEAABahfE329ttvy2azacqUKVZHAQBYhPI12eWp12azWR0FAGARytdEu3btUllZmWbNmmV1\nFACAhShfE+Xk5Ojxxx9XSEiI1VEAABbiUSOTHDlyRBMmTFBZWZkiIyOtjgMAsBCTr0kWL16shx56\niOIFADD5muHMmTNKSkrS4cOH1b17d6vjAAAsxuRrgqVLl+r73/8+xQsAkMTk2+GqqqqUkJCg3bt3\nKz4+3uo4AAAvwOTbwV544QVlZmZSvAAAA5NvB3I6nUpISFB+fr6Sk5OtjgMA8BJMvh1o9erVGjp0\nKMULAGiGybeDuFwu3XbbbVq2bJnS09OtjgMA8CJMvh1k/fr1ioiIUFpamtVRAABehvLtIGygAAC4\nGsq3A5SUlOj06dOaOXOm1VEAAF6I8u0AOTk5mjdvnoKDg62OAgDwQtxw5WEHDhxQWlqaysrKFB4e\nbnUcAIAXYvL1sMWLF2vu3LkULwDgqph8Pai8vFzDhg3T0aNHFRMTY3UcAICXYvL1oKVLl+ree++l\neAEA18Tk6yEVFRVKTEzUhx9+qP79+1sdBwDgxZh8PeS5557T9OnTKV4AwHUx+d4Al8ulHTt2qLy8\nXLW1tercubOGDx+uXr16KT4+XgUFBfra175mdUwAgJezWx3AF1y6dEl/XbFCzz71lEKqqzVEUrjb\nrcqgIG1zOtWvb1/17dtXSUlJVkcFAPgAJt/r2Lhxo+6ZNUtT3W49XFurcZKuXDCyTtLrkv4UHi7b\ngAHKLypSr169rAkLAPAJlO81vL5mjR677z79ra5Ot1/nvW5Jv7Pb9VJMjD4oLVWfPn3MiAgA8EGU\n71Xs2rVLM1JTVVhbq6/fwHF/sNv12s03a+f+/QoLC+uwfAAA38Xdzlfx2wUL9L9vsHglaUFjo2LP\nnNGbb77ZIbkAAL6PybcFx48f16ghQ3TS4VBEG45fJ2nxsGH6YN8+T0cDAPgBJt8WPL98ue5xudpU\nvJI0Q9KJo0e1j/IFALSA8m3B9s2bNd3pbPPxdklT3W5t377dc6EAAH6D8m3BpcpKtXd15hinUxUV\nFR7JAwDwL5RvC8JCQ9X2ufef6oODudsZANAiyrcFvXr31tF2fsbh4GB169bNI3kAAP6F8m3B93/8\nY70UFdXm48slvedw6NFHH9Xs2bO1Zs0aVVZWei4gAMCnUb4tuPvuu3UoOFgH2nj8i8HBuu/++7V/\n/35NmjRJK1euVL9+/ZSZmanly5frxIkTHs0LAPAtPOd7Fb/6+c91YMkSve5w3ND/oZRLGhkerqLd\nuzV06FDj9ZqaGhUUFCgvL08bNmxQ3759lZWVpaysLI0YMUI2m+3qHwoA8CuU71XU1dUpbexYjT90\nSIsaGtSaajwvaXJEhGb/8pea/4tfXPV9TU1N2rZtm/Ly8pSbm6va2lrdddddys7OVmpqKjdqAYCf\no3yv4cKFC5qRmqrEo0f1e4dD/a/yPrekYkk/jIjQdx55RL9duPCGJtnDhw8rNzdXeXl5+vjjj5WR\nkaHs7GxNmzZNsbGxnvgpAAAvQvleR21trf7jySf111de0USbTT/68st/7ucrqVLSFptNz0RGqqlL\nF/3H736n2f/+7+36vnPnzmnjxo3Kzc3Vli1blJycrKysLGVnZ2vgwIGe+EkAAItRvq1UU1Oj//vq\nq3pl2TJ9fvq0auvr1TkyUskjR+qhefOUkpLi8eu2dXV1KioqUl5envLy8tS1a1fjOvHYsWMVHBzs\n0e8DAJiD8vURLpdLe/bsMYr47NmzmjFjhrKyspSRkaGIiLauRA0AMBvl66OOHTum/Px85eXlaffu\n3UpJSVFWVpZmzJihnj17Wh0PAHANlK8fuHTpkjZt2qS8vDy98847GjRokLKzs5WVlaWkpCQeYwIA\nL0P5+hmn06n33nvPuHvabrcbN2xNmDBBdrvd6ogAEPAoXz/mdrv10UcfGc8Tl5WV6c4771RWVpam\nTp2qm266yeqIABCQKN8AUl5ervXr1ys3N1cffPCB7rjjDuPu6X79+lkdDwACBuUboKqrq5std9m/\nf3+jiJOTk7lODAAdiPKFGhsbmy136XA4jCJOSUlhuUsA8DDKF8243W4dOnTIeJ74H//4hzIzM5WV\nlaVp06YpJibG6ogA4PMoX1zTuXPntH79euXl5amoqEgjRoww7p5OTEy0Oh4A+CTKF61WV1enLVu2\nKDc3V/n5+YqNjW223GVQENtDA0BrUL5oE5fLpd27dxvXiS9cuGAsdzl58mSWuwSAa6B84RGffvqp\n8vPzlZubq7179yo1NdVY7rJHjx5WxwMAr0L5wuO++OKLZstdDhkyxFjucsiQITzGBCDgUb7oUE6n\nU++++65x93RoaKhRxOPHj2e5SwABifKFadxut/bt22esO338+HFNmzZN2dnZmjJliqKjo62OCACm\noHxhmc8++8xY7rKkpETjx4837p7u27ev1fEAoMNQvvAKVVVVzZa7vPnmm40iHj58ONeJAfgVyhde\np7GxUSUlJcZjTE6ns9lyl6GhoVZHBIB2oXzh1dxutw4ePGjcsHXw4EFjucs777yT5S4B+CTKFz7l\nzJkz2rBhg/Ly8rR161aNHDnSuHs6ISHB6ngA0CqUL3xWbW2tNm/erLy8POXn56t79+5GEY8ePZrl\nLgF4LcoXfsHlcmnXrl3GY0wXL17UXXfdZSx3GR4ebnVEADBQvvBLR48eNZa7LC0tVVpamrHcZVxc\nnPG+/Px8DRs2TAMGDLAwLYBAQ/nC7128eNFY7rKgoEBDhw5VVlaWMjIyNH78eDkcDg0fPty4o3rE\niBE82gSgQ1G+CCj19fXGcpdr1qzRxYsXv/KePn36GEWcmpqqsLAwC5IC8GeULwLW/fffrxUrVlzz\nPVFRUZoyZYqys7M1bdo0xcbGmpQOgD+jfBGwXnzxRa1cuVLbtm2Ty+W67vuDgoI0YcIE447qgQMH\nejSP0+nUuXPnVF1draioKMXFxTF1A36K8kXAO3/+vDZu3Kjc3Fy98847qq2tbdVxQ4YMUVZWlrKz\nszVmzBgFBwe36fsPHTqkZ5cs0apVqxQuKTo4WNVNTaqTNHv2bD30058qKSmpTZ8NwDtRvsAVHA6H\nioqKjBW1Tp8+3arj4uLiNGPGDONGroiIiOsec+nSJd0zc6Z279ihBxsa9KPGRvW/4t8/k/Si3a4X\nQ0I0fNQorXrrLXXr1q1tPwyAV6F8gatwuVzau3evUcQfffRRq47r1KmTMjIyjEebevbs+ZX3nDlz\nRmm3366pp0/r906nrnVy2SnpP0NDtS4uTlt37lTv3r3b9oMAeA3KF2ilsrIy5efnKy8vT8XFxWps\nbLzuMTabTWPHjjXunk5KSlJdXZ0mjRypGUeP6tet+IzL/o/drrXx8Xq/tFRRUVHt+SkALEb5Am1Q\nUVFhPDu8ceNGVVVVteq4xMRE9evbV+E7dmhDfb1u5Glit6T/ER6uO37zGz3x5JNtyg3AO1C+QDs5\nnU69//77xtKWJ06cuOb7oyRtkDSpDd+1Q9K/9eypI59/ztrVgA+jfAEPcrvd+vjjj429iPfs2fOV\n9wyQVCbd0NRrfL6kkdHR+sPatcrMzGxnWgBWoXyBDvT5559r/fr1ys3N1ZYtW+RyOvW/JP1HOz5z\nkaTPfvQj/en55z2UEoDZOG8FdKA+ffpozpw52rhxoy5evKiUcePUq52f2VPSF2fOeCIeAItQvoBJ\noqKi1K9fv3Z/jlvSnj179Je//EWfffZZ+4MBMJ3d6gBAIInt1UunbTapHVd7TksqO3VKDzzwgCRp\n0KBByszMVEZGhlJSUhQdHe2htAA6Ctd8ARMVFxfrx9On68CXX7b5hqtE/fOGrZbY7XaNGzdOGRkZ\nysjI0KhRo2S38//YgLehfAETud1u3XbzzVp+8qRS23B8iaQpkr5s5fu7dOmitLQ0YzJOSEhow7cC\n8DTKFzDZn5cv1/oFC7ShtvaGbrpwS/pmeLjiH3xQMd26qaCgQDt27FBTU1OrPyMhIcEo4rS0NHXp\n0uWG8wNoP8oXMFldXZ3Sxo7VNw4d0u8bGlp9+vlXdrs23XKLivfsMTZuqKqq0rvvvquCggIVFhbq\nyJEjrc4RFBSkMWPGKCMjQ5mZmRo7dqxCQkLa8IsA3CjKF7DA+fPnlT5unCaWl2txfb3Cr/Feh6QF\noaHa3KuXinbuVI8ePa763hMnTqiwsFCFhYXavHmzvvjii1Znio6OVkpKijEZ33rrrbLZ2nJlGsD1\nUL6ARSorK/Xg976nrVu36l6XSw85nRp4xb8fk/RcSIhWBAdrwsSJWvH66zd0mripqUkffvihUcYl\nJSVyOp2tPr5fv35GEaenp7OdIeBBlC9gsbKyMj33pz/pLy+9JFdDg6LtdlU3Nspmt+u+Bx7Qjx99\nVImJie3+ni+//FLvvfeeUcb79+9v9bE2m035+fmaPn16u3MAoHwBr9HU1KRLly6pqqpK0dHR6tq1\na4c+JnTq1Clt3rzZKOOzZ89e8/1/+9vfNG3aNIWGhnZYJiBQUL4AjA0hCgsLVVBQoPfee08Oh8P4\n97i4OPXv31+HDx/WpEmTjJu0Bg8ezHVhoA0oXwBf4XA4VFJSYtxFnZGRoYULF+rixYvasmWLUdJN\nTU1GEU+ePFndu3e3OjrgEyhfANflcrm+sn+w2+3WJ598Ypy2fvfddxUfH2/cpDVhwgR16tTJosSA\nd6N8AXhEQ0ODdu3aZUzFH3/8se644w5jqcthw4Zxihr4b5QvgA5RWVmprVu3Gqeuq6qqjCLOyMhQ\n7969rY4IWIbyBWCKsrIy4xR1UVGRevXqZVwvnjRpkiIjI62OCJiG8gVguqamJu3du9co471792rU\nqFHG9eLk5GQFBwdbHRPoMJQvAMvV1NSouLjYuF587tw5paenG6eoBwwYYHVEwKMoXwBep7y8vNka\n1V27djWKODU1VTfddJPVEYF2oXwBeDWXy6V9+/YZZbxjxw59/etfN64Xjx49ukNXAgM6AuULwKfU\n1dXp/fffN8r4xIkTzXZjSkxM5JEmeD3KF4BPO3v2rLFGdUFBgcLCwowiTktLU0xMjNURga+gfAH4\nDbfbrQMHDhjPFn/wwQcaMmSIcb143LhxbAwBr0D5AvBb9fX12rZtm3GK+siRI5o4cSIbQ8BylC+A\ngNHSxhCXT1GzMQTMRPkCCEhXbgxRUFCg4uJiJSQkGKeo2RgCHYnyBQD9/40hLl8vZmMIdCTKFwBa\nUFFRoa1btxrXi6urqzV58mQ2hoBHUL4A0ApXbgyxZcsW9e7dm40h0GaULwDcoCs3higoKFBpaalG\njx5tTMUjRoxQUFCQ1THhxShfAGinyxtDXL5ezMYQuB7KFwA87MqNIQoLCxUTE2Ocok5JSTFtY4i9\ne/dq7Wuv6dxnn6mxoUFde/RQ2tSpmj59Ols2WozyBYAOdLWNIS4/X+zpjSEaGxu1evVqPbNwoc6e\nOKF7HA71c7lkl3RB0lvR0ToVFqY5jz6qh+bOVdeuXT323Wg9yhcATHTlxhAFBQU6efKkUlNTjVPU\n7dkYoqamRt/NytKlXbv08y+/1J2SWppvSyUt7dRJ22JitKm4WAMHDmzPT0IbUL4AYKHLG0Ncvl7c\nqVMno4hvZGMIp9OpOydNUr99+/Siw6GQVhzzQlCQ/qtLF5WUlnJd2mSULwB4iWttDJGZmanbb7/9\nqhtDPP7wwzr2yit6s66uxWn3ap4ODtaqhASVHj7MIiImonwBwEtduTFEQUGBPvnkE02cONG4Xnx5\nY4jKykrd3LOnDjgc6nWD3+GWNCwqSkvWrVN6enpH/Ay0gPIFAB9x4cIFFRUVGZOxy+VSRkaGXE1N\nql27Vq/X1rbpc5+VtDkzU2++845nA+OqKF8A8EGXN4YoKCjQb+fP1+t1dfpGGz+rWtKATp108Phx\n9ejRw5MxcRWULwD4uE4hIbrU2KjwdnzG7Z0764+bNmncuHEey4WrY/0zAPBhDQ0NamxqalfxSlK0\npOrqak9EQitQvgDgw+x2u4KDglTXzs+plhQdHe2JSGgFyhcAfJjNZtOtfftqTzs+o0bSEYdD8fHx\nnoqF66B8AcDH/fBnP9OzERFtPv5VSd+YOFE9e/b0XChcEzdcAYCPq6ioUHyvXjrkcOhG71V2Sxoe\nFaXFb72ljIyMjoiHFjD5AoCP69Kli+655x49Eh4u1w0euzwoSO64OBbYMBmTLwD4gfr6emWOH69b\n9u/Xc/X1as0+SStsNv2yc2eVlJZyvddkTL4A4AfCwsK0futWlY8Zo/SICL0tXXUK/kjSA2Fh+m1c\nnIq2b6d4LcDkCwB+pKGhQX/961/15z/8QdVnzuie2lr1d7uN/XzfjI7WseBg/WjuXD3y2GPq1q2b\n1ZEDEuULAH7I7XZr586dWvvqqzr/+edqcDrVNS5OqXfeqezsbIWEtGbTQXQUyhcAAJNxzRcAAJNR\nvgAAmIzyBQDAZJQvAAAmo3wBADAZ5QsAgMkoXwAATEb5AgBgMsoXAACTUb4AAJiM8gUAwGSULwAA\nJqN8AQAwGeULAIDJKF8AAExG+QIAYDLKFwAAk1G+AACYjPIFAMBklC8AACajfAEAMBnlCwCAyShf\nAABMRvkCAGAyyhcAAJNRvgAAmIzyBQDAZJQvAAAmo3wBADAZ5QsAgMkoXwAATEb5AgBgMsoXAACT\nUb4AAJiM8gUAwGSULwAAJqN8AQAwGeULAIDJKF8AAExG+QIAYLL/B/++ZNulbGzKAAAAAElFTkSu\nQmCC\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x7f91cea193d0>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import networkx as nx\n",
    "%matplotlib inline\n",
    "\n",
    "results = %cypher MATCH p = (:Person)-[:LIKES]->(:Drink) RETURN p\n",
    "\n",
    "g = results.get_graph()\n",
    "\n",
    "nx.draw(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[(u'52', {u'age': 24, 'labels': [u'Person'], u'name': u'Nicole'}),\n",
       " (u'51', {u'calories': 9000, 'labels': [u'Drink'], u'name': u'Mountain Dew'}),\n",
       " (u'48', {u'age': 20, 'labels': [u'Person'], u'name': u'Drew'}),\n",
       " (u'49', {u'calories': 0, 'labels': [u'Drink'], u'name': u'Coke Zero'})]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.nodes(data=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{u'48': 1, u'49': 1, u'51': 2, u'52': 2}"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nx.degree(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph as PGraph\n",
    "from igraph import Graph as IGraph\n",
    "\n",
    "neo4j = PGraph()\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name AS source, drink.name AS target\n",
    "\"\"\"\n",
    "\n",
    "data = neo4j.run(query)\n",
    "tups = []\n",
    "\n",
    "for d in data:\n",
    "    tups.append((d[\"source\"], d[\"target\"]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<igraph.Graph at 0x7fe511208430>"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ig = IGraph.TupleList(tups)\n",
    "\n",
    "ig"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[u'Mountain Dew', u'Nicole']"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "best = ig.vs.select(_degree = ig.maxdegree())[\"name\"]\n",
    "best"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {
    "collapsed": false,
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-f9f8a2b9-d603-4596-8a06-9fe170a85ca8\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {jgraph: ['nbextensions/jgraph.min', 'https://rawgit.com/patrickfuller/jgraph/master/js/build/jgraph.min']}});\n",
       "           require(['jgraph'], function () {\n",
       "               var $d = $('#graph-f9f8a2b9-d603-4596-8a06-9fe170a85ca8');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.jgraph = jQuery.extend({}, jgraph);\n",
       "               $d.jgraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true,\n",
       "                                     showSave: false});\n",
       "               $d.jgraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 1, \"target\": 2 },\n",
       "        { \"source\": 2, \"target\": 3 },\n",
       "        { \"source\": 3, \"target\": 4 },\n",
       "        { \"source\": 4, \"target\": 1 },\n",
       "        { \"source\": 4, \"target\": 5 },\n",
       "        { \"source\": 5, \"target\": 2 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"1\": { \"location\": [ -1.999, -2.000, -2.000 ] },\n",
       "        \"2\": { \"location\": [ -1.422, -1.033, -0.812 ] },\n",
       "        \"3\": { \"location\": [ -0.032, -0.076, 0.024 ] },\n",
       "        \"4\": { \"location\": [ 0.951, 0.876, 1.158 ] },\n",
       "        \"5\": { \"location\": [ 2.000, 2.000, 2.000 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.jgraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import jgraph\n",
    "\n",
    "jgraph.draw([(1, 2), (2, 3), (3, 4), (4, 1), (4, 5), (5, 2)])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-dc7f552a-79fd-4d2f-8bbd-8e34a9800db7\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {jgraph: ['nbextensions/jgraph.min', 'https://rawgit.com/patrickfuller/jgraph/master/js/build/jgraph.min']}});\n",
       "           require(['jgraph'], function () {\n",
       "               var $d = $('#graph-dc7f552a-79fd-4d2f-8bbd-8e34a9800db7');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.jgraph = jQuery.extend({}, jgraph);\n",
       "               $d.jgraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true,\n",
       "                                     showSave: false});\n",
       "               $d.jgraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 48, \"target\": 51 },\n",
       "        { \"source\": 50, \"target\": 51 },\n",
       "        { \"source\": 52, \"target\": 51 },\n",
       "        { \"source\": 52, \"target\": 49 },\n",
       "        { \"source\": 53, \"target\": 49 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"48\": { \"location\": [ -2.000, -2.000, -2.000 ] },\n",
       "        \"49\": { \"location\": [ -1.543, -1.365, -1.742 ] },\n",
       "        \"50\": { \"location\": [ -0.249, -0.378, -0.680 ] },\n",
       "        \"51\": { \"location\": [ 0.600, 0.409, 0.511 ] },\n",
       "        \"52\": { \"location\": [ 1.693, 1.531, 1.558 ] },\n",
       "        \"53\": { \"location\": [ 2.000, 2.000, 2.000 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.jgraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "data = graph.run(\"MATCH (n)-->(m) RETURN ID(n), ID(m)\")\n",
    "data = [tuple(x) for x in data]\n",
    "\n",
    "jgraph.draw(data)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
