{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Neo4j con Python"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "http://nicolewhite.github.io/neo4j-jupyter/hello-world.html"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "\n",
    "graph = Graph()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "graph.delete_all()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "from py2neo import Node\n",
    "\n",
    "nicole = Node(\"Person\", name=\"Nicole\", age=24)\n",
    "drew = Node(\"Person\", name=\"Drew\", age=20)\n",
    "\n",
    "mtdew = Node(\"Drink\", name=\"Mountain Dew\", calories=9000)\n",
    "cokezero = Node(\"Drink\", name=\"Coke Zero\", calories=0)\n",
    "\n",
    "coke = Node(\"Manufacturer\", name=\"Coca Cola\")\n",
    "pepsi = Node(\"Manufacturer\", name=\"Pepsi\")\n",
    "\n",
    "graph.create(nicole | drew | mtdew | cokezero | coke | pepsi)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"/tmp/graph-537b75ed-6e29-4a8a-ab95-4dbb09046260.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7f1e8a450b50>"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from scripts.vis import draw\n",
    "\n",
    "options = {\"Person\": \"name\", \"Drink\": \"name\", \"Manufacturer\": \"name\"}\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"/tmp/graph-829aef46-0725-462e-bf60-67c1f4f9b8be.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7f1e8a1d8ed0>"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Relationship\n",
    "\n",
    "graph.create(Relationship(nicole, \"LIKES\", cokezero))\n",
    "graph.create(Relationship(nicole, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(drew, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(coke, \"MAKES\", cokezero))\n",
    "graph.create(Relationship(pepsi, \"MAKES\", mtdew))\n",
    "\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(u'name': u'Drew', u'drink': u'Mountain Dew')\n",
      "(u'name': u'Nicole', u'drink': u'Mountain Dew')\n",
      "(u'name': u'Nicole', u'drink': u'Coke Zero')\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name AS name, drink.name AS drink\n",
    "\"\"\"\n",
    "\n",
    "data = graph.run(query)\n",
    "\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(u'name': u'Nicole', u'avg_calories': 4500.0)\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p:Person)-[:LIKES]->(drink:Drink)\n",
    "WHERE p.name = {name}\n",
    "RETURN p.name AS name, AVG(drink.calories) AS avg_calories\n",
    "\"\"\"\n",
    "\n",
    "data = graph.run(query, name=\"Nicole\")\n",
    "\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>person.name</th>\n",
       "        <th>drink.name</th>\n",
       "        <th>drink.calories</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Drew</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Coke Zero</td>\n",
       "        <td>0</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[u'Drew', u'Mountain Dew', 9000],\n",
       " [u'Nicole', u'Mountain Dew', 9000],\n",
       " [u'Nicole', u'Coke Zero', 0]]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name, drink.calories"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Drew</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Coke Zero</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name         drink\n",
       "0    Drew  Mountain Dew\n",
       "1  Nicole  Mountain Dew\n",
       "2  Nicole     Coke Zero"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = %cypher MATCH (person:Person)-[:LIKES]->(drink:Drink) \\\n",
    "                  RETURN person.name AS name, drink.name AS drink\n",
    "    \n",
    "df = results.get_dataframe()\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAeAAAAFBCAYAAACvlHzeAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAHD1JREFUeJzt3Xt4VfWd7/FPsndCLiSzE0JCwCDhEm6RSwSKgBASnPE4\nMqCiLaWD433E0z46nB49c05P69Sn1dFHSxWU1tYz9VL6zGCtHW0dh2SHhIABFBRBUAh3DAnXhJ2Q\nfVnnjyn7IYoll5381lr7/frHssnafJHKO7/1W2vtBMuyLAEAgD6VaHoAAADiEQEGAMAAAgwAgAEE\nGAAAAwgwAAAGEGAAAAwgwAAAGECAAQAwgAADAGAAAQYAwAACDACAAQQYAAADCDAAAAYQYAAADCDA\nAAAYQIABADCAAAMAYAABBgDAAAIMAIABBBgAAAMIMAAABhBgAAAMIMAAABhAgAEAMIAAAwBgAAEG\nAMAAAgwAgAFe0wMAAJwrFApp8+bNamxsVCgUUlZWlqZMmaKMjAzTo9keAQYAdFlDQ4NeXL1aq3/6\nU2W1t6sgIUFeSU2SdgaDWrx4se5/6CEVFxebHtW2EizLskwPAQBwjuefe07/+N3vapGk+9vaVPKF\nnz8i6ecej36WnKzrFyzQC//yL0pOTjYwqb0RYABApz32/e/r5aee0h8CAQ2/zNeek7Q4LU2hqVP1\nu3ffVVJSUl+M6BhchAUA6JRXX35Zv3zqKa3vRHwlKV3S64GAPJs367/fdVdvj+c4rIABAJcVDoc1\nYtAg/aapSV/r4rEtkoanpKj2o480cuTI3hjPkVgBAwAu6+2331be+fNdjq8k9Zd0RzisF37601iP\n5WisgAEAl/Xfrr1W36ip0e3dPH6fpGnp6TrU2KjU1NRYjuZYrIABAJdVs3mz/qYHxw+XdIXHo507\nd8ZqJMcjwACAPysUCinQ3i5fD98nOyFBp06dislMbkCAAQB/VmJiohISEhTq4fu0S9wPfBECDAD4\nShceNZmZnKwDPXifiKSDwaDy8vJiNZrj8ShKAEBUJBLRjh07tG7dOlVUVKi6ulpDhw7ViFGj9OLO\nnXo8HO7W+/6npAH5+SoqKortwA7GVdAAEMcsy9Knn36qiooKVVRUqLKyUllZWSorK1NZWZlKS0uV\nm5ur3bt3a/akSTrY1qZ+3fh1Fqan66+fflr33HtvzH8PTkWAASDOHDp0KBrciooKWZal8vLyaHQL\nCgouedx111yjG+rq9FAk0qVfb4ukv0pP18GGBqWnp8fgd+AOBBgAXO748ePy+/3R08qnT5+Oxras\nrEwjR45UQkLCZd9n7969mnX11Vp55oxu7uSvvUfS3NRUrfr1r7VgwYIe/T7chgADgMucPn1a69ev\nj65wDx48qNmzZ0eDW1xcrMTE7l2Du3XrVs2fN08PnT2rByIRpX3F10Uk/buke1NT9fhzz+nv7ryz\nu78d1yLAAOBwgUBAGzZsUEVFhdatW6ddu3Zp+vTp0eBeffXV8npjd83tvn379ODdd6t240Z9MxTS\nXaGQCiQl6b8+D3htYqKeT02Vb/BgPbFqlebNmxezX9tNCDAAOEx7e7vq6uqip5S3bt2qSZMmRfdx\np0+frn79unOpVNfs379fty5cqCP79ikQCikUDisrPV1l5eV64Lvf1dSpUzt1ajteEWAAsLlwOKwP\nPvggekq5trZWRUVF0RXurFmz1L9/fyOzjRs3Tq+88opKSkqM/PpORoABwGYsy9LOnTujwa2qqlJ+\nfn40uHPmzFF2drbpMfX5559r7NixampqksfjMT2O4/AgDgAwzLIs1dfXR08pV1ZWKi0tTWVlZbrt\nttv0/PPPa9CgQabH/JKqqirNnj2b+HYTAQYAA44ePdrhXtz29naVlZXpuuuu049+9CMVFhaaHvGy\nKisrVVpaanoMx+IUNAD0gRMnTsjv90eDe/z4cZWWlqqsrEzl5eUaPXq04y5YGjNmjNasWaNJkyaZ\nHsWRCDAA9ILm5mZVV1dHTyvv3btXs2bNil6pPHHixG7fi2sHR48e1VVXXaXGxkZH/z5M4hQ0AMRA\nW1ubamtroyvcDz/8UNOmTVNZWZlWrlypqVOnKikpyfSYMeP3+zV79mzi2wMEGAC6IRgMasuWLdHg\n1tXVqbi4WGVlZfrhD3+oGTNmKDU11fSYvcbv92vu3Lmmx3A0TkEDQCdEIhF9+OGH0VPKNTU1Kiws\njJ5Svvbaa5WZmWl6zD4zatQorV27VhMmTDA9imMRYAC4BMuytHv37ugK1+/3Kycnp8PH9OXk5Jge\n04jDhw9r8uTJamho4BR0D3AKGgD+5MCBAx1uDfJ4PCovL9eCBQu0YsUKDRkyxPSItuD3+zVnzhzi\n20MEGEDcamho6BDclpaW6Ar3Bz/4gYYPH+64W4P6Avf/xganoAHEjVOnTqmqqioa3CNHjmjOnDnR\n6I4fP57gdsKIESP05ptvavz48aZHcTQCDMC1zp07p5qamujH9O3evVszZsyIBrekpITHKHbRwYMH\nNWXKFDU0NPDNSg9xChqAa5w/f17vvfde9ErlDz74QCUlJSovL9czzzyjadOm9cnH9LmZ3+9XaWkp\n8Y0BAgzAsUKhkN5///3oKeWNGzdq7NixKisr0/e+9z3NnDlT6enppsd0lcrKSu7/jRFOQQNwjEgk\noo8//jga3PXr1+uKK67o8DF9Pp/P9JiuNmzYMP3hD3/Q2LFjTY/ieATYQQ4fPqyfrVypta++quOn\nTikUDis7I0Nl112nZcuXa/LkyaZHBLrFsizt3btXgwcPVlpa2pdev7CHW1lZqczMzOjDL0pLS5WX\nl2dw8viyf/9+TZ8+XceOHeMUdAwQYAc4cOCAHrrnHvnXr9cSSbefP6+hkjySmiSt9Xj0Qr9+GlJY\nqMdXrtScOXPMDgx0wuHDhzvcAnTo0CG9+eabmjx5cofXw+FwNLhz587VlVdeaXr0uPXSSy/pnXfe\n0Zo1a0yP4goE2Oa2bdumvy4r0wNnzug7kYj6f8XXhSX9VtIDqal65mc/0ze/9a0+nBK4vMbGxg4f\nx7dnz54vfY3P55PH49HcuXOjp5WLiopYbdnE7bffrhkzZui+++4zPYorEGAbq6+v18ySEv3k9Gnd\n1sljdkoqT03VL/7t33TDDTf05nhwmGAwqDfeeEO/eOYZ7auv17m2NmWmpWn8VVfpvuXLVV5eHtMn\nG509e1br16+Pnj7+8MMPL3tMUVGRdu3axROWbMiyLF155ZV69913NXr0aNPjuAJXQdvYfUuWaPnZ\ns52OrySNk/R6a6v+5utf14GGhg77aYhPoVBITzz2mFb+5CcaHYno75ubNVFSuqTm06dVc/So/seG\nDWrNyNDDjz6qO+++u1srztbWVm3YsCG6wt2yZYvC4XCnj09JSdHQoUMVDocJsA3t27dPoVBIRUVF\npkdxDQJsU3v27NH2bdv0+0iky8deI+lrkn7zm9/ojjvuiPlscI5AIKCvz5+vtk2b9J+BgMZd4mvG\nSbqnpUW1LS36+wcf1LbNm7XihRcuG8FgMKi6urpocGtra9Xe3t7p2bxeb/TzcsvLyzV9+nSlpKR0\n7TeIPnPh4wfZDogdAmxTL6xYobtCIXX3kQHLWlr0/SeeIMBxLBwOa8lNN6l/ba1eb2vTn/so+ARJ\nMyXVBAK64dVX9Y/9++vxp5/+0vtt3749ekq5urpa586d6/Q8CQkJmjx5cnRvd9asWcrIyOjW7w19\nj+c/xx57wDaV7/Op+swZjezm8WFJQ9PSVLV9u0aO7O67wMlWv/CCXl6+XBWBgJK7cNwJSVPS0vT/\n3n5bubm50adK+f1+nTp1qkszXHgoxoV7dAcMGNCl42EPlmWpoKBAfr+fv09iiBWwDUUiER0/e1aF\nPXgPj6ShHo927Nghn8+n5ORkJSUlKSkpSR6Ph9NILmdZllY+8YSe6WJ8JWmApOWBgG76y7/UqS6c\nUpakK6+8UuXl5SovL9fcuXOVn5/fxV8ddvTZZ59J+q8PYUDsEGAbCoVCSpDU08tQgi0tuuOOO5SY\nmKhgMKj29vboHl1SUlI0yhfH2S6vfdXPeb1ex37z8MYbb+ijjz7qtX8/SUlJ0X83GzZsUHtTk8q6\nOetSSf+zE/EdNGhQdIVbVlamwsKefNsIu7rw+Emn/rdnVwTYhpKTk9XP61VzMKjMHrxPMCND69at\nU0lJSYfXw+GwgsFgNMoX/7Mnr134Z1tbm86ePRuz9734f4dCIXm9Xtt/o3Cp19auXatXXnmlZ//n\nuAyv16ukpCR5QyH972BQ3f3rMlPSQkm//sLrPp+vwz26Y8eO5S/lOOD3+zVv3jzTY7gOAbapmVdf\nrd9v2qQl3Tx+n6Qj4bDGjBnzpZ/zeDzyeDyOvOLUsqxufVPQldcCgUCvfPPQlSuEuysUCikUCilT\nUk/v1LxK0uter+bOmxd9EtXEiRP5+L44Y1mWKisr9dhjj5kexXUIsE0te/hhPbl0qZY0N3fr+NVJ\nSbr9jjtcdx9wQkKCkpOTlZyc7LhPubnlllv0+uuv98mvlSB1+wr6C1Ik3XPnnXp29eoYTASn2rNn\nj5KTk9le6AUE2KZuvPFGfTspSVslXd3FY89Jesnj0YbvfKcXJkN3LVq0SGPHjo35iv3i0/MXRCR1\n7XrlLzslacCgQT18FzjdhduP2GqIPQJsU16vVz988kl949vfVm0goIGdPC4saUlqquYvXKhRo0b1\n5ojoosWLF/fq+198ev6Zp5/WWz/+sb7Z2tq995L0Vv/+emz69NgOCcfx+/26/vrrTY/hStwHbHP/\n95FHtPbZZ/V2IKDLfQZMq6RvpaWpefJk/XtFhZKTu3oDCtzi5MmTGj5kiPa0tSm3G8fXSfpGbq4+\nO3aMx0LGMcuylJ+fr02bNmnYsGGmx3Ed/suyuX96/HHd8+ijmpySogf69dOOS3zN55Ie83hUlJam\n9Btu0O/XrSO+cS47O1s3L1yoF7sZz+dSU3X/P/wD8Y1zu3btUmpqKvHtJayAHeLw4cP6+fPP6+er\nVmlIJKICSV7LUmNCgra1t+vWW2/V/Q89pMmTJ5seFTaxa9cuzZ46VW+cO6eZXTjulYQE/Z+cHL3/\nySfKzs7utflgf6tWrdKWLVv0y1/+0vQorkSAHSYYDGrjxo1qbGxUKBRSVlaWpk2bJp/PZ3o02NAf\n//hHLb3lFq0JBDr1UI6XEhL0vzIytK62VuPHj+/1+WBvt956q+bPn6+lS5eaHsWVCDDgclVVVbpt\n/nzNDYe1LBDQtVKHB3SEJL0laVX//vqsf3+9VVl5yfvHEV8sy1JeXp62bt2qgoIC0+O4EgEG4sCZ\nM2f08q9+pVVPPqmEU6c0ISFB/cNhnfV4tDEc1hXDh2vZww9r0aJFjnxAC2Jvx44dWrhwYfQ50Ig9\nAgzEEcuytHHjRtXX1+vcuXPKzMzUuHHjNGHCBNOjwWaeffZZbd++XS+++KLpUVyLAAMAvuSWW27R\nzTffrCVLuvtAXFwOAQYAdBCJRJSbm6vt27dryJAhpsdxLW7yAwB0sGPHDmVnZxPfXkaAAQAdXPj8\nX/QuAgwA6ODCBzCgd7EHDACIikQiysnJ0ccff6z8/HzT47gaK2AAQNT27duVm5tLfPsAAQYARPn9\nfvZ/+wgBBgBEcQFW32EPGAAgSQqHw8rJydEnn3yivLw80+O4HitgAIAkadu2bRo8eDDx7SMEGAAg\niduP+hoBBgBI4gKsvsYeMABAoVBIOTk5+vTTTzVw4EDT48QFVsAAAL3//vsqKCggvn2IAAMAOP1s\nAAEGAHABlgHsAQNAnAsGgxowYIDq6+s1YMAA0+PEDVbAABDntm7dqsLCQuLbxwgwAMQ5Hj9pBgEG\ngDjHBVhmsAcMAHGsvb1dOTk5OnDggLKyskyPE1dYAQNAHNuyZYtGjhxJfA0gwAAQx7j9yBwCDABx\njP1fc9gDBoA4df78eeXk5OjQoUPy+Xymx4k7rIABIE7V1dVp9OjRxNcQAgwAcYrTz2YRYACIU1yA\nZRZ7wAAQh9ra2jRw4EAdOXJEmZmZpseJS6yAASAOvffeexo3bhzxNYgAA0Ac4vSzeQQYAOIQF2CZ\nxx4wAMSZ1tZWDRw4UMeOHVNGRobpceIWK2AAiDObNm3SVVddRXwNI8AAEGf4/F97IMAAEGe4AMse\n2AMGgDgSCASUm5urhoYGpaenmx4nrrECBoA4Ultbq4kTJxJfGyDAABBHuP3IPggwAMQR9n/tgz1g\nAIgTLS0tGjRokI4fP660tDTT48Q9VsAAECdqa2tVUlJCfG2CAANAnOD0s70QYACIE1yAZS/sAQNA\nHGhublZ+fr4aGxuVmppqehyIFTAAxIWamhpNmTKF+NoIAQaAOMDpZ/shwAAQB7gAy37YAwYAlzt7\n9qwGDx6spqYmpaSkmB4Hf8IKGABcrrq6WtOmTSO+NkOAAcDl2P+1JwIMAC5XWVlJgG2IPWAAcLHT\np0+roKBATU1N6tevn+lxcBFWwADgYtXV1Zo+fTrxtSECDAAuxu1H9kWAAcDFuADLvtgDBgCXOnny\npIYNG6YTJ04oKSnJ9Dj4AlbAAOBS69ev1zXXXEN8bYoAA4BLcfrZ3ggwALgUF2DZG3vAAOBCJ06c\n0PDhw9XU1MQpaJtiBQwALlRVVaWZM2cSXxsjwADgQpx+tj8CDAAuxAVY9sceMAC4TGNjo0aNGqWm\npiZ5vV7T4+ArsAIGAJepqqrSrFmziK/NEWAAcBn2f52BAAOAy/D5v87AHjAAuEhDQ4PGjBmjpqYm\neTwe0+Pgz2AFDAAu4vf7de211xJfByDAAOAi3H7kHAQYAFyEC7Ccgz1gAHCJo0ePqri4WE1NTUpM\nZH1ld/wJAYBLVFVVac6cOcTXIfhTAgCX4PSzsxBgAHAJLsByFgIMAC5w5MgRnTx5UsXFxaZHQScR\nYABwgcrKSvZ/HYY/KQBwAU4/Ow8BBgAX4AIs5yHAAOBwBw8eVHNzs8aPH296FHQBAQYAh/P7/Zoz\nZ44SEhJMj4IuIMAA4HDs/zoTAQYAh+Pzf52JAAOAg+3fv1+tra0aM2aM6VHQRQQYABzM7/ertLSU\n/V8HIsAA4GDcfuRcBBgAHMqyLC7AcjACDAAOVV9fr2AwqKKiItOjoBsIMAA41IXTz+z/OhMBBgCH\n4vSzsxFgAHAgy7K4AMvhCDAAONDevXslSSNHjjQ8CbqLAAOAA114+hX7v85FgAHAgTj97HwJlmVZ\npocAAHSeZVkaMmSIampqNHz4cNPjoJtYAQOAw+zZs0der1eFhYWmR0EPEGAAcJgLtx+x/+tsBBgA\nHIb9X3dgDxgAHMSyLOXn52vTpk0aNmyY6XHQA6yAAcBBPvnkE6WmphJfFyDAAOAgnH52DwIMAA7C\n85/dgz1gAHAIy7KUl5enLVu2aOjQoabHQQ95TQ8AALi8YDCo3bt3KyMjg/i6BKegAcDmgsGgBg0a\npAULFigzM1MVFRWKRCKmx0IPcQoaAGxu48aNmjFjRvTHeXl5OnbsGA/icDhWwABgc36/v8OPS0tL\nia8LEGAAsLnKysoOP+YqaHfgFDQA2Fh7e7uysrIUCASir+3evVtFRUUGp0IssAIGABvbvHlzh/jm\n5+dr1KhRBidCrBBgALCxS51+Zv/XHQgwANjYpS7AgjuwBwwANnX+/Hn5fD61tbVFX/v00081cuRI\ng1MhVlgBA4BN1dXVdYjvFVdcoREjRhicCLFEgAHApr64/8v9v+5CgAHAprj/193YAwYAG2pra5PP\n59P58+ejr+3du1fDhw83OBViiRUwANjQpk2bOsR36NChKiwsNDgRYo0AA4AN8fxn9yPAAGBD7P+6\nH3vAAGAzra2t8vl8am9vj75WX1+vYcOGmRsKMccKGABsZuPGjR3iO2zYMOLrQgQYAGyG08/xgQAD\ngM3w/Of4wB4wANhIIBCQz+dTMBiMvnbw4EEVFBQYnAq9gRUwANhIbW1th/iOGDGC+LoUAQYAG7nU\n85/hTgQYAGyEC7DiB3vAAGATLS0tysrKUigUir52+PBhDRkyxOBU6C2sgAHAJjZs2NAhvqNGjSK+\nLkaAAcAmuP0ovhBgALAJ9n/jC3vAAGADzc3NysrKUjgcjr529OhR5efnG5wKvYkVMADYQE1NTYf4\njh49mvi6HAEGABvg9HP8IcAAYANcgBV/2AMGAMPOnDmj7OxsRSKR6Guff/658vLyDE6F3sYKGAAM\nq66u7hDfcePGEd84QIABwDBOP8cnAgwAhnEBVnxiDxgADDp9+rSys7N18V/Fx48f18CBAw1Ohb7A\nChgADFq/fn2H+BYXFxPfOEGAAcCgL+7/cvo5fhBgADDoi/u/XIAVP9gDBgBDTp48qZycnA6noJua\nmjRgwACDU6GvsAIGAEO+uP87YcIE4htHvKYHAIB4c/DgQTU2Nuq1117r8Dr7v/GFAANAH2htbdWa\nNWu06okndODAAV2RnKzWlhblSApIapM0adIkw1OiL7EHDAC97Le//a3uXbpU0yQta2nR9ZI8F/38\nVklPS3qrXz9958EH9eiPf6yEhAQjs6LvEGAA6EUvrl6t7z/0kH7X2qopl/naBkkL09M15sYb9YvX\nXlNiIpfpuBkBBoBe8vbbb+uuRYtU09qqEZ08JiBpXnq6ypYt02P//M+9OR4MI8AA0Assy9LYggI9\ne+SIruvisY2SRqekaMfevRo8eHBvjAcb4PwGAPSCyspKJZ05o3ndOHagpMWWpZ8//3ysx4KNsAIG\ngF6w6PrrVf7OO7q/m8fvkPRXPp/2Hz+upKSkWI4Gm2AFDAC94D/8ft3ag+OLJf1FOKyPP/44ViPB\nZggwAMRYMBhUoL1d2T18n9zERJ06dSomM8F+CDAAxFisbh8Kx/C9YD/8yQJAjHk8Hv1FWpqO9uA9\nLElHQiHl5OTEaizYDAEGgF5w04IF+lUPVq8bJCX7fBo3blzshoKtEGAA6AXLli/XCykpCnfz+FVp\nabp/+XIeSeli3IYEAL1k+vjxWrZzp5Z28bg9kr6WkqL6Y8fk8/l6YzTYACtgAOglq15+WcvT0lTT\nhWOOSbohLU1PrlhBfF2OAANALykpKdFrb7yhm9LS9JqkyGW+fouka1JTdfcjj+jue+/tgwlhEqeg\nAaCXbd26VfcsXqyzR4/q/tZW/V0kogF/+rnzkl6XtDIjQ/u9Xj2xYoWW/O3fGpwWfYUAA0AfsCxL\ndXV1WvXUU/rX3/1Osix5ExMVCIVUOmWKHnjkEc2fP19er9f0qOgjBBgA+phlWQoEAgqFQsrIyOBh\nG3GKAAMAYADfdgEAYAABBgDAAAIMAIABBBgAAAMIMAAABhBgAAAMIMAAABhAgAEAMIAAAwBgAAEG\nAMAAAgwAgAEEGAAAAwgwAAAGEGAAAAwgwAAAGECAAQAwgAADAGAAAQYAwAACDACAAQQYAAADCDAA\nAAYQYAAADCDAAAAYQIABADCAAAMAYAABBgDAAAIMAIABBBgAAAMIMAAABhBgAAAMIMAAABhAgAEA\nMIAAAwBgAAEGAMAAAgwAgAEEGAAAAwgwAAAGEGAAAAwgwAAAGECAAQAwgAADAGAAAQYAwAACDACA\nAQQYAAADCDAAAAYQYAAADCDAAAAYQIABADCAAAMAYAABBgDAAAIMAIABBBgAAAMIMAAABhBgAAAM\nIMAAABhAgAEAMIAAAwBgAAEGAMAAAgwAgAEEGAAAAwgwAAAGEGAAAAwgwAAAGECAAQAwgAADAGAA\nAQYAwID/D/QdzZ9SbiIXAAAAAElFTkSuQmCC\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x7f1e78180b90>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import networkx as nx\n",
    "%matplotlib inline\n",
    "\n",
    "results = %cypher MATCH p = (:Person)-[:LIKES]->(:Drink) RETURN p\n",
    "\n",
    "g = results.get_graph()\n",
    "\n",
    "nx.draw(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[(u'1', {u'calories': 0, 'labels': [u'Drink'], u'name': u'Coke Zero'}),\n",
       " (u'0', {u'age': 20, 'labels': [u'Person'], u'name': u'Drew'}),\n",
       " (u'3', {u'calories': 9000, 'labels': [u'Drink'], u'name': u'Mountain Dew'}),\n",
       " (u'4', {u'age': 24, 'labels': [u'Person'], u'name': u'Nicole'})]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.nodes(data=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{u'0': 1, u'1': 1, u'3': 2, u'4': 2}"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nx.degree(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph as PGraph\n",
    "from igraph import Graph as IGraph\n",
    "\n",
    "neo4j = PGraph()\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name AS source, drink.name AS target\n",
    "\"\"\"\n",
    "\n",
    "data = neo4j.run(query)\n",
    "tups = []\n",
    "\n",
    "for d in data:\n",
    "    tups.append((d[\"source\"], d[\"target\"]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<igraph.Graph at 0x7f1e77b90338>"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ig = IGraph.TupleList(tups)\n",
    "\n",
    "ig"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[u'Mountain Dew', u'Nicole']"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "best = ig.vs.select(_degree = ig.maxdegree())[\"name\"]\n",
    "best"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "collapsed": false,
    "scrolled": true
   },
   "outputs": [
    {
     "ename": "ImportError",
     "evalue": "No module named jgraph",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mImportError\u001b[0m                               Traceback (most recent call last)",
      "\u001b[1;32m<ipython-input-17-a6b08f9febca>\u001b[0m in \u001b[0;36m<module>\u001b[1;34m()\u001b[0m\n\u001b[1;32m----> 1\u001b[1;33m \u001b[1;32mimport\u001b[0m \u001b[0mjgraph\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m      2\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m      3\u001b[0m \u001b[0mjgraph\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mdraw\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m[\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;36m1\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;36m2\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;33m(\u001b[0m\u001b[1;36m2\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;36m3\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;33m(\u001b[0m\u001b[1;36m3\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;36m4\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;33m(\u001b[0m\u001b[1;36m4\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;36m1\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;33m(\u001b[0m\u001b[1;36m4\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;36m5\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;33m(\u001b[0m\u001b[1;36m5\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;36m2\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m]\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;31mImportError\u001b[0m: No module named jgraph"
     ]
    }
   ],
   "source": [
    "import jgraph\n",
    "\n",
    "jgraph.draw([(1, 2), (2, 3), (3, 4), (4, 1), (4, 5), (5, 2)])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-dc7f552a-79fd-4d2f-8bbd-8e34a9800db7\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {jgraph: ['nbextensions/jgraph.min', 'https://rawgit.com/patrickfuller/jgraph/master/js/build/jgraph.min']}});\n",
       "           require(['jgraph'], function () {\n",
       "               var $d = $('#graph-dc7f552a-79fd-4d2f-8bbd-8e34a9800db7');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.jgraph = jQuery.extend({}, jgraph);\n",
       "               $d.jgraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true,\n",
       "                                     showSave: false});\n",
       "               $d.jgraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 48, \"target\": 51 },\n",
       "        { \"source\": 50, \"target\": 51 },\n",
       "        { \"source\": 52, \"target\": 51 },\n",
       "        { \"source\": 52, \"target\": 49 },\n",
       "        { \"source\": 53, \"target\": 49 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"48\": { \"location\": [ -2.000, -2.000, -2.000 ] },\n",
       "        \"49\": { \"location\": [ -1.543, -1.365, -1.742 ] },\n",
       "        \"50\": { \"location\": [ -0.249, -0.378, -0.680 ] },\n",
       "        \"51\": { \"location\": [ 0.600, 0.409, 0.511 ] },\n",
       "        \"52\": { \"location\": [ 1.693, 1.531, 1.558 ] },\n",
       "        \"53\": { \"location\": [ 2.000, 2.000, 2.000 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.jgraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "data = graph.run(\"MATCH (n)-->(m) RETURN ID(n), ID(m)\")\n",
    "data = [tuple(x) for x in data]\n",
    "\n",
    "jgraph.draw(data)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
